"""
读取文件
将文件写出到bill.txt.bak文件作为备份
同时，将文件内标记为测试的数据行丢弃

实现思路：
open和r模式打开一个文件对象，并读取文件
open和w模式打开另一个文件对象，用于文件写入
for循环内容，判断是否是测试。不是测试就write写出，是测试的话就continue跳过
将2个文件对象均close
"""
# f = open("09_04_bill.txt", "w", encoding="UTF-8")
# f.write("name,\t date,\t money,\t type, remarks")
# f.write("\n周杰伦,2022-01-01,100000,消费,正式")
# f.write("\n周杰伦,2022-01-02,300000,收入,正式")
# f.write("\n周杰伦,2022-01-03,100000,消费,测试")
# f.write("\n林俊杰,2022-01-01,300000,收入,正式")
# f.write("\n林俊杰,2022-01-02,100000,消费,测试")
# f.write("\n林俊杰,2022-01-03,100000,消费,正式")
# f.write("\n林俊杰,2022-01-04,100000,消费,测试")
# f.write("\n林俊杰,2022-01-05,500000,收入,正式")
# f.write("\n张学友,2022-01-01,100000,消费,正式")
# f.write("\n张学友,2022-01-02,500000,收入,正式")
# f.write("\n张学友,2022-01-03,900000,收入,测试")
# f.write("\n王力宏,2022-01-01,500000,消费,正式")
# f.write("\n王力宏,2022-01-02,300000,消费,测试")
# f.write("\n王力宏,2022-01-03,950000,收入,正式")
# f.write("\n刘德华,2022-01-01,300000,消费,测试")
# f.write("\n刘德华,2022-01-02,100000,消费,正式")
# f.write("\n刘德华,2022-01-03,300000,消费,正式")
# f.close()

fr = open("09_04_bill.txt", "r", encoding="UTF-8")
fw = open("09_04_bill.txt.bak", "w", encoding="UTF-8")
for line in fr:            # for循环读取文件的每一行，作为列表的一个元素
    line = line.strip()    # 去除每一行(列表元素)开头和结尾的空格、换行符
    # print(line)            # line的内容是：去除换行符后，文件的其余内容
    # print(type(line))      # 打印出line是什么类型：字符串类型
    if line.split(",")[4] == "测试":  # 使用.split方法切割后得到的是一个列表
        continue
    fw.write(line)
    fw.write("\n")

# close两个文件对象
fr.close()
fw.close()
